//Выведите на экран все положительные делители натурального числа, введённого пользователем с клавиатуры.

package net.perfsys.trainees.ascherbakov.task_0.lessonsfrompasha.java_loops;

import java.util.Scanner;

public class Java_loops_task8 {
    public static void main(String[] args) {


        Scanner scn = new Scanner(System.in);
        System.out.println("Введите число и которого нужен факториал");
        int n = scn.nextInt();
    }
}

