package net.perfsys.trainees.akupcov.task_2;
//3. В переменной n хранится вещественное число с ненулевой дробной частью.
// Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.
public class InTeger {
    public static void main(String[] args) {
        int Number = (int) Math.round(3.6999);
        System.out.println(Number);
    }
}
